In [1]:
from datascience import *

import numpy as np
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt

In [54]:
#reading csv files
cab = pd.read_csv('Cab_Data.csv')
city = pd.read_csv('City.csv')
customer_id= pd.read_csv('Customer_ID.csv')
transaction_id = pd.read_csv('Transaction_ID.csv')

In [55]:
cab

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.6320
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.6020
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.7760
...,...,...,...,...,...,...,...
359387,10440101,43108,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,43104,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,43105,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,43105,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,43102,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

In [56]:
city

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [57]:
customer_id

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [58]:
transaction_id

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [59]:
transactions_of_customers = pd.merge(customer_id, transaction_id, on = "Customer ID")

In [60]:
#transactions_of_customers

In [61]:
cabs_of_customers = pd.merge(cab, transactions_of_customers, on = "Transaction ID")

In [62]:
#cabs_of_customers

In [63]:
city_data_cabs = pd.merge(city, cabs_of_customers, on = "City")

In [64]:
#city_data_cabs

In [65]:
cleaned_cityDataCabs = city_data_cabs.drop_duplicates()

In [66]:
#cleaned_cityDataCabs

In [82]:
cleaned_cityDataCabs = cleaned_cityDataCabs.sort_values(["City", "Company", "Gender", "Age", "Income (USD/Month)", "Payment_Mode", "Price Charged"])

In [83]:
cleaned_cityDataCabs

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode
256941,ATLANTA GA,"814,885","24,701",10225532,43001,Pink Cab,22.08,210.12,262.752,29108,Female,18,3944,Card
255959,ATLANTA GA,"814,885","24,701",10171654,42862,Pink Cab,29.12,445.50,346.528,29108,Female,18,3944,Card
255661,ATLANTA GA,"814,885","24,701",10153732,42815,Pink Cab,26.75,322.52,283.550,27514,Female,18,3991,Card
255476,ATLANTA GA,"814,885","24,701",10141256,42769,Pink Cab,37.45,528.12,419.440,27514,Female,18,3991,Card
260215,ATLANTA GA,"814,885","24,701",10415887,43434,Pink Cab,33.00,380.54,372.900,28347,Female,18,6439,Card
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318118,WASHINGTON DC,"418,859","127,001",10347642,43287,Yellow Cab,4.20,55.83,57.960,51285,Male,65,34100,Cash
290480,WASHINGTON DC,"418,859","127,001",10072023,42610,Yellow Cab,8.55,130.94,110.808,51285,Male,65,34100,Cash
294023,WASHINGTON DC,"418,859","127,001",10108963,42693,Yellow Cab,19.00,294.68,246.240,51285,Male,65,34100,Cash
308770,WASHINGTON DC,"418,859","127,001",10257135,43049,Yellow Cab,29.16,434.46,384.912,51285,Male,65,34100,Cash
288129,WASHINGTON DC,"418,859","127,001",10046968,42539,Yellow Cab,43.60,916.43,549.360,51285,Male,65,34100,Cash